# Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('people-example.csv')

In [3]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [8]:
df['age'] > 23

0     True
1    False
2    False
3    False
4    False
5    False
6     True
Name: age, dtype: bool

In [9]:
df [df['age'] <=23]

  First Name Last Name        Country  age
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22

In [10]:
df[df['Country']=='USA']

  First Name Last Name Country  age
3      Felix     Brown     USA   23

In [15]:
person = {'First Name': 'Joe', 'Last Name': 'Williams', 'Country':'Canada', 
         'age': 19}
person

{'Country': 'Canada', 'First Name': 'Joe', 'Last Name': 'Williams', 'age': 19}

In [25]:
df.size

28

In [28]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [29]:
df.loc[5]

First Name              Tod
Last Name          Campbell
Country       United States
age                      22
Name: 5, dtype: object

In [30]:
df.loc[6]

First Name          Derek
Last Name            Ward
Country       Switzerland
age                    25
Name: 6, dtype: object

In [31]:
df.loc[7]=person

In [32]:
person

{'Country': 'Canada', 'First Name': 'Joe', 'Last Name': 'Williams', 'age': 19}

In [33]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25
7        Joe  Williams         Canada   19

In [39]:
df[df['Last Name']=='Williams']

  First Name Last Name Country  age
1      Alice  Williams  Canada   23
7        Joe  Williams  Canada   19

In [42]:
df[df['Last Name']=='Williams' && df['age'] < 20]

SyntaxError: invalid syntax (<ipython-input-42-5c4b1ffd9708>, line 1)

In [43]:
df2 = df.copy()
df2

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25
7        Joe  Williams         Canada   19

In [44]:
person

{'Country': 'Canada', 'First Name': 'Joe', 'Last Name': 'Williams', 'age': 19}

In [45]:
person2 = {'Country': 'France', 'First Name': 'Nikolas', 'Last Name': 'Sarkozi', 'age': 55}

In [46]:
df2.loc[8]=person2

In [47]:
df2

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25
7        Joe  Williams         Canada   19
8    Nikolas   Sarkozi         France   55

In [48]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25
7        Joe  Williams         Canada   19